## IMPORT PANDAS

In [2]:
import pandas as pd
import numpy as np
pd.__version__

'2.2.2'

In [3]:
s = pd.Series([10,20,30])
s

0    10
1    20
2    30
dtype: int64

In [4]:
df = pd.DataFrame({
    "name":["Rupesh","Charan"],
    "age":[19,20]
})
df

     name  age
0  Rupesh   19
1  Charan   20

## WRITING THE DATA INTO FILES

In [6]:
df.to_csv('data.csv',index=False)

In [7]:
df.to_excel('new.xlsx',sheet_name = 'weather_data')

## READ THE FILE

In [9]:
df = pd.DataFrame({
    "city":["kakinada","anakapalli","machilipatnam","vizag","pallevelugu"],
    "temperature":[28,29,30,31,32],
    "humidity":[60,62,58,55,57],
    "condition":["sunny","sunny","cloudy","cloudy","rainy"]
})
df

            city  temperature  humidity condition
0       kakinada           28        60     sunny
1     anakapalli           29        62     sunny
2  machilipatnam           30        58    cloudy
3          vizag           31        55    cloudy
4    pallevelugu           32        57     rainy

## EXPLORING DATA

In [11]:
df.head(3)

            city  temperature  humidity condition
0       kakinada           28        60     sunny
1     anakapalli           29        62     sunny
2  machilipatnam           30        58    cloudy

In [12]:
df.tail()

            city  temperature  humidity condition
0       kakinada           28        60     sunny
1     anakapalli           29        62     sunny
2  machilipatnam           30        58    cloudy
3          vizag           31        55    cloudy
4    pallevelugu           32        57     rainy

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   city         5 non-null      object
 1   temperature  5 non-null      int64
 2   humidity     5 non-null      int64
 3   condition    5 non-null      object
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes

In [14]:
df['city'][df['condition']=='cloudy']

2    machilipatnam
3            vizag
Name: city, dtype: object

In [15]:
df.shape

(5, 4)

In [16]:
df[2:4]

            city  temperature  humidity condition
2  machilipatnam           30        58    cloudy
3          vizag           31        55    cloudy

In [17]:
df.columns

Index(['city', 'temperature', 'humidity', 'condition'], dtype='object')

In [18]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [19]:
df.dtypes

city           object
temperature     int64
humidity        int64
condition      object
dtype: object

In [20]:
df.city

0         kakinada
1       anakapalli
2    machilipatnam
3            vizag
4      pallevelugu
Name: city, dtype: object

In [21]:
df.temperature

0    28
1    29
2    30
3    31
4    32
Name: temperature, dtype: int64

## MISSING VALUES

In [23]:
df.isnull()

    city  temperature  humidity  condition
0  False        False     False      False
1  False        False     False      False
2  False        False     False      False
3  False        False     False      False
4  False        False     False      False

In [24]:
df = pd.DataFrame({
    "name":["Rupesh","Charan","Sree Ram"],
    "age":[19,20,None]
})
df

       name   age
0    Rupesh  19.0
1    Charan  20.0
2  Sree Ram   NaN

In [25]:
df.isnull()

    name    age
0  False  False
1  False  False
2  False   True

In [26]:
df.isnull().sum()

name    0
age     1
dtype: int64

In [27]:
df[df.isnull().any(axis=1)]

       name  age
2  Sree Ram  NaN

In [28]:
df['age'] = df['age'].fillna(df['age'].mean())

In [29]:
df

       name   age
0    Rupesh  19.0
1    Charan  20.0
2  Sree Ram  19.5

In [30]:
df_clean = df.dropna()

In [31]:
df_clean

       name   age
0    Rupesh  19.0
1    Charan  20.0
2  Sree Ram  19.5

## DUPLICATES

In [33]:
df = pd.DataFrame({
    "name":["Rupesh","Charan","Rupesh"],
    "age":[19,20,19]
})
df

     name  age
0  Rupesh   19
1  Charan   20
2  Rupesh   19

In [75]:
df.duplicated()

0    False
1    False
2     True
dtype: bool

In [77]:
df[df.duplicated()]

     name  age
2  Rupesh   19